<?php

return [
    'months' => [
        'იანვარი',
        'თებერვალი',
        'მარტი',
        'აპრილი',
        'მაისი',
        'ივნისი',
        'ივლისი',
        'აგვისტო',
        'სექტემბერი',
        'ოქტომბერი',
        'ნოემბერი',
        'დეკემბერი'
    ],

    'days' => [
        'კვირა',
        'ორშაბათი',
        'სამშაბათი',
        'ოთხშაბათი',
        'ხუთშაბათი',
        'პარასკევი',
        'შაბათი',
    ],

    'months_index' => [
        '01' => 'იანვარი',
        '02' => 'თებერვალი',
        '03' => 'მარტი',
        '04' => 'აპრილი',
        '05' => 'მაისი',
        '06' => 'ივნისი',
        '07' => 'ივლისი',
        '08' => 'აგვისტო',
        '09' => 'სექტემბერი',
        '10' => 'ოქტომბერი',
        '11' => 'ნოემბერი',
        '12' => 'დეკემბერი'
    ],
];
