<?php

return [
    '401' => [
        'title'   => 'წვდომა შეზღუდულია',
        'message' => 'თქვენ არ გაქვთ ამ გვერდზე წვდომა',
    ],
    '404' => [
        'title'   => 'გვერდი ვერ მოიძებნა',
        'message' => 'გვერდი არ არსებობს ან დროებით მიუწვდომელია',
    ],
    '500' => [
        'title'   => 'სერვერის შეცდომა',
    ],
    '503' => [
        'title'   => 'სერვისი დროებით მიუწვდომელია',
        'message' => 'სერვისი დროებით მიუწვდომელია ტექნიკური ხარვეზის ან პროგრამული განახლების გამო',
    ],
    'try_again' => 'გთხოვთ სცადოთ მოგვიანებით ან დაბრუნდეთ მთავარ გვერდზე.',
];
