<?php

return [
    'auth' => 'ავტორიზაცია',
    'email' => 'ელ-ფოსტის მისამართი',
    'username' => 'მომხმარებელი',
    'password' => 'პაროლი',
    'new_password' => 'ახალი პაროლი',
    'password_confirmation' => 'გაიმეორეთ პაროლი',
    'submit' => 'შესვლა',
    'forgot' => 'პაროლის აღდგენა',
    'login' => 'შესვლა',
    'logout' => 'გამოსვლა',
    'remember' => 'სისტემაში დარჩენა',
    'reset' => [
        'intro' => 'პაროლის აღსადგენად დააჭირეთ ქვემოთ მოცემულ ლინკს',
        'name' => 'პაროლის აღდგენა',
        'button' => 'აღდგენა',
        'title' => 'პაროლის აღდგენა',
        'click' => 'პაროლის აღსადგენად',
        'action' => 'დააკლიკეთ ამ ბმულს',
        'security' => 'უსაფრთხოების მიზნით გთხოვთ',
        'changePassword' => 'შეცვალოთ პაროლი',
    ]
];
